#include <stdio.h>    //include为预处理指令。stdio.h为头文件，包含了输入输出函数（IO）如printf函数）
int main()//函数首部 main为函数名 ，int是一种数据类型,是C语言32关键字中的一种，其中关键字可以分为数据类型等等）， 不能用int定义int
{/*函数体*/
	int num;    //1.定义num为整型(无小数点） 2.声明num为变量（num为标识符。标识符也就是一个变量，函数或其他实体的名称）（变量需声明后使用）
	num = 1;
	int age;
	age = 10;
	printf("I am a simple\n");
	printf("computer\n");
	printf("my favorite number is %d because it is nice.\n", num);
	return  0;//main被指明为int类型是需要带回一个整数作为main函数的结束
}
/*C语言的关键字
C语言有32个关键字，这些关键字是C语言保留的词语，具有特殊的作用。关键字可以分为数据类型关键字、控制语句关键字、存储类型关键字和其他关键字四类。
数据类型关键字
数据类型关键字用于声明变量的类型，包括基本数据类型、类型修饰关键字和复杂类型关键字。

基本数据类型
void：声明函数无返回值或无参数，声明无类型指针。
char：声明字符型变量。
int：声明整型变量。
float：声明单精度浮点型变量。
double：声明双精度浮点型变量。

类型修饰关键字
short：修饰int，表示短整型数据。
long：修饰int，表示长整型数据。
signed：修饰整型数据，表示有符号数据类型。
unsigned：修饰整型数据，表示无符号数据类型。

复杂类型关键字
struct：声明结构体变量。
union：声明共用体或联合数据类型。
enum：声明枚举类型。
typedef：给数据类型取别名。
sizeof：计算数据类型或变量的大小。

控制语句关键字，控制语句关键字用于控制程序的执行流程，包括循环语句、条件语句和开关语句。

循环语句
for：遍历循环。
do：其后紧跟循环体。
while：条件循环或死循环。
break：跳出当前循环。
continue：终止本次循环，开始下次循环。

条件语句
if：条件语句。
else：条件语句否定分支。
goto：无条件跳转语句。

开关语句
switch：用于多条件判断语句。
case：多条件判断语句分支。
default：开关语句的其它分支。

存储类型关键字，存储类型关键字用于声明变量的存储方式和作用域。
auto：声明自动变量，由编译器自动分配及释放。
extern：声明变量是在其他文件定义。
register：声明寄存器变量，建议编译器将变量存储到寄存器中。
static：声明静态变量，分配在静态变量区。

其他关键字 其他关键字用于声明只读变量、计算数据类型长度等。
const：声明只读变量。
volatile：所修饰的对象不能被编译器优化。
return：函数返回语句。*/